ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/src/em_can.c
/***************************************************************************//**
 * @file em_can.c
 * @brief Controller Area Network API
 * @version 5.3.3
 *******************************************************************************
 * # License
 * <b>Copyright 2016 Silicon Laboratories, Inc. http://www.silabs.com</b>
 *******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Labs has no
 * obligation to support this Software. Silicon Labs is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Silicon Labs will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ******************************************************************************/

#include "em_can.h"
#include "em_common.h"
#include "em_assert.h"
#include "em_cmu.h"
#include <stddef.h>

#if defined(CAN_COUNT) && (CAN_COUNT > 0)

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/* Macros to use the ID field in the CANn_MIRx_ARB register as a 11 bit
 * standard id. The register field can be used for both an 11 bit standard
 * id and a 29 bit extended id. */
#define _CAN_MIR_ARB_STD_ID_SHIFT         18
#define _CAN_MIR_MASK_STD_SHIFT           18
#define _CAN_MIR_ARB_STD_ID_MASK          0x1FFC0000UL
#define _CAN_MIR_ARB_STD_ID_MAX           0x7FFUL // = 2^11 - 1

#if (CAN_COUNT == 2)
#define CAN_VALID(can)  ((can == CAN0) || (can == CAN1))
#elif (CAN_COUNT == 1)
#define CAN_VALID(can)  (can == CAN0)
#else
#error "The actual number of CAN busses is not supported."
#endif

/** @endcond */

/***************************************************************************//**
 * @addtogroup emlib
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup CAN
 * @brief Controller Area Network API
 *
 * @details The Controller Area Network Interface Bus (CAN) implements a
 * multi-master serial bus for connecting microcontrollers and devices, also
 * known as nodes, to communicate with each other in applications without a host
 * computer. CAN is a message-based protocol, designed originally for automotive
 * applications, but meanwhile used also in many other surroundings.
 * The complexity of the node can range from a simple I/O device up to an
 * embedded computer with a CAN interface and sophisticated software. The node
 * may also be a gateway allowing a standard computer to communicate over a USB
 * or Ethernet port to the devices on a CAN network. Devices are connected to
 * the bus through a host processor, a CAN controller, and a CAN transceiver.
 *
 * @include em_can_send_example.c
 *
 * @{
 ******************************************************************************/

/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Initialize CAN.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] init
 *   Pointer to CAN initialization structure.
 ******************************************************************************/
void CAN_Init(CAN_TypeDef *can, const CAN_Init_TypeDef *init)
{
    EFM_ASSERT(CAN_VALID(can));

    CAN_Enable(can, false);
    can->CTRL = _CAN_CTRL_TEST_MASK;
    can->TEST = _CAN_TEST_RESETVALUE;
    if (init->resetMessages) {
        CAN_ResetMessages(can, 0);
    }
    can->CTRL = CAN_CTRL_INIT;
    CAN_SetBitTiming(can,
                     init->bitrate,
                     init->propagationTimeSegment,
                     init->phaseBufferSegment1,
                     init->phaseBufferSegment2,
                     init->synchronisationJumpWidth);
    CAN_Enable(can, init->enable);
}

/***************************************************************************//**
 * @brief
 *   Get the CAN module frequency.
 *
 * @details
 *   There is an internal prescaler of 2 inside the CAN module.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @return
 *   Clock value
 ******************************************************************************/
uint32_t CAN_GetClockFrequency(CAN_TypeDef *can)
{
#if defined CAN0
    if (can == CAN0) {
        return CMU_ClockFreqGet(cmuClock_CAN0) / 2;
    }
#endif

#if defined CAN1
    if (can == CAN1) {
        return CMU_ClockFreqGet(cmuClock_CAN1) / 2;
    }
#endif
    EFM_ASSERT(false);
    return 0;
}

/***************************************************************************//**
 * @brief
 *   Read a Message Object to find if a message was lost ; reset the
 *   'Message Lost' flag.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] msgNum
 *   Message number of the Message Object, [1 - 32].
 *
 * @return
 *   true if a message was lost, false otherwise.
 ******************************************************************************/
bool CAN_MessageLost(CAN_TypeDef *can, uint8_t interface, uint8_t msgNum)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];
    bool messageLost;

    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((msgNum > 0) && (msgNum <= 32));

    CAN_ReadyWait(can, interface);

    /* Set which registers to read from the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD_READ
                   | CAN_MIR_CMDMASK_CONTROL
                   | CAN_MIR_CMDMASK_CLRINTPND;

    /* Send reading request and wait (3 to 6 cpu cycle) */
    CAN_SendRequest(can, interface, msgNum, true);

    messageLost = mir->CTRL & _CAN_MIR_CTRL_MESSAGEOF_MASK;

