ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/src/em_can.c
    if (messageLost) {
        mir->CMDMASK = CAN_MIR_CMDMASK_WRRD | CAN_MIR_CMDMASK_CONTROL;

        /* Reset the 'MessageLost' bit */
        mir->CTRL &= ~_CAN_MIR_CTRL_MESSAGEOF_MASK;

        /* Send reading request and wait (3 to 6 cpu cycle) */
        CAN_SendRequest(can, interface, msgNum, true);
    }

    /* Return the state of the MESSAGEOF bit */
    return messageLost;
}

/***************************************************************************//**
 * @brief
 *   Set the ROUTE registers.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] active
 *   Boolean to activate or not the ROUTE registers.
 *
 * @param[in] pinRxLoc
 *   Location of the rx pin.
 *
 * @param[in] pinTxLoc
 *   Location of the tx pin.
 ******************************************************************************/
void CAN_SetRoute(CAN_TypeDef *can,
                  bool active,
                  uint16_t pinRxLoc,
                  uint16_t pinTxLoc)
{
    if (active) {
        /* Set the ROUTE register */
        can->ROUTE = CAN_ROUTE_TXPEN
                     | (pinRxLoc << _CAN_ROUTE_RXLOC_SHIFT)
                     | (pinTxLoc << _CAN_ROUTE_TXLOC_SHIFT);
    } else {
        /* Deactivate the ROUTE register */
        can->ROUTE = 0x0;
    }
}

/***************************************************************************//**
 * @brief
 *   Set the bitrate and its parameters
 *
 * @details
 *   There are multiple parameters which need to be properly configured.
 *   Please refer to the reference manual for a detailed description.
 *   Careful : the BRP (Baud Rate Prescaler) is calculated by:
 *   'brp = freq / (period * bitrate);'. freq is the frequency of the CAN
 *   device, period the time of transmission of a bit. The result is an uint32_t
 *   hence it's truncated, causing an approximation error. This error is non
 *   negligeable when period is high, bitrate is high and freq is low.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] bitrate
 *   Wanted bitrate on the CAN bus.
 *
 * @param[in] propagationTimeSegment
 *   Value for the Propagation Time Segment.
 *
 * @param[in] phaseBufferSegment1
 *   Value for the Phase Buffer Segment 1.
 *
 * @param[in] phaseBufferSegment2
 *   Value for the Phase Buffer Segment 2.
 *
 * @param[in] synchronisationJumpWidth
 *   Value for the Synchronisation Jump Width.
 ******************************************************************************/
void CAN_SetBitTiming(CAN_TypeDef *can,
                      uint32_t bitrate,
                      uint16_t propagationTimeSegment,
                      uint16_t phaseBufferSegment1,
                      uint16_t phaseBufferSegment2,
                      uint16_t synchronisationJumpWidth)
{
    uint32_t sum, brp, period, freq, brpHigh, brpLow;

    /* Verification that the parameters are within range */
    EFM_ASSERT((propagationTimeSegment <= 8) && (propagationTimeSegment > 0));
    EFM_ASSERT((phaseBufferSegment1 <= 8) && (phaseBufferSegment1 > 0));
    EFM_ASSERT((phaseBufferSegment2 <= 8) && (phaseBufferSegment2 > 0));
    EFM_ASSERT(bitrate > 0);
    EFM_ASSERT((synchronisationJumpWidth <= phaseBufferSegment1)
               && (synchronisationJumpWidth <= phaseBufferSegment2)
               && (synchronisationJumpWidth > 0));

    /* propagationTimeSegment is counted as part of phaseBufferSegment1 in the
       BITTIMING register */
    sum = phaseBufferSegment1 + propagationTimeSegment;

    /* period is the total length of one CAN bit. 1 is the Sync_seg */
    period = 1 + sum + phaseBufferSegment2;
    freq = CAN_GetClockFrequency(can);

    brp = freq / (period * bitrate);
    EFM_ASSERT(brp != 0);

    /* -1 because the hardware reads 'written value + 1' */
    brp = brp - 1;

    /* brp is divided between two registers */
    brpHigh = brp / 64;
    brpLow = brp % 64;

    /* Checking register limit */
    EFM_ASSERT(brpHigh <= 15);

    bool enabled = CAN_IsEnabled(can);

    /* Enable access to the bittiming registers */
    can->CTRL |= CAN_CTRL_CCE | CAN_CTRL_INIT;

    can->BITTIMING = (brpLow << _CAN_BITTIMING_BRP_SHIFT)
                     | ((synchronisationJumpWidth - 1) << _CAN_BITTIMING_SJW_SHIFT)
                     | ((sum - 1) << _CAN_BITTIMING_TSEG1_SHIFT)
                     | ((phaseBufferSegment2 - 1) << _CAN_BITTIMING_TSEG2_SHIFT);
    can->BRPE = brpHigh;

    if (enabled) {
        can->CTRL &= ~(_CAN_CTRL_CCE_MASK | _CAN_CTRL_INIT_MASK);
    } else {
        can->CTRL &= ~_CAN_CTRL_CCE_MASK;
    }
}

/***************************************************************************//**
 * @brief
 *   Set the CAN operation mode.
 *
 * @details
 *   In Init mode, the CAN module is deactivated. Reset of the Messages in all
 *   the other modes to be sure that there are no leftover data and that they
 *   need to be configured before being of use.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] mode
 *   Mode of operation : Init, Normal, Loopback, SilentLoopback, Silent, Basic.
 ******************************************************************************/
void CAN_SetMode(CAN_TypeDef *can, CAN_Mode_TypeDef mode)
{
    switch (mode) {
        case canModeNormal:
            can->CTRL |= _CAN_CTRL_TEST_MASK;
            can->TEST = _CAN_TEST_RESETVALUE;
            can->CTRL &= ~_CAN_CTRL_TEST_MASK;

            can->CTRL = _CAN_CTRL_EIE_MASK
                        | _CAN_CTRL_SIE_MASK
                        | _CAN_CTRL_IE_MASK;
            break;

        case canModeBasic:
            can->CTRL = _CAN_CTRL_EIE_MASK
                        | _CAN_CTRL_SIE_MASK
                        | _CAN_CTRL_IE_MASK
                        | CAN_CTRL_TEST;
            can->TEST = CAN_TEST_BASIC;
            break;

        case canModeLoopBack:
            can->CTRL = _CAN_CTRL_EIE_MASK
                        | _CAN_CTRL_SIE_MASK
                        | _CAN_CTRL_IE_MASK
                        | CAN_CTRL_TEST;
            can->TEST = CAN_TEST_LBACK;
            break;

        case canModeSilentLoopBack:
            can->CTRL = _CAN_CTRL_EIE_MASK
                        | _CAN_CTRL_SIE_MASK
                        | _CAN_CTRL_IE_MASK
                        | CAN_CTRL_TEST;
            can->TEST = CAN_TEST_LBACK | CAN_TEST_SILENT;
            break;

        case canModeSilent:
            can->CTRL = _CAN_CTRL_EIE_MASK
                        | _CAN_CTRL_SIE_MASK
                        | _CAN_CTRL_IE_MASK
                        | CAN_CTRL_TEST;
            can->TEST = CAN_TEST_SILENT;
            break;

        default:
            break;
    }
}

/***************************************************************************//**
 * @brief
 *   Set the Id and the filter for a specific Message Object.
 *
 * @details
 *   The Init bit have to be 0 to use this function.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] useMask
 *   Boolean to choose whether or not to use the masks.
 *
 * @param[in] message
 *   Message Object
 *
 * @param[in] wait
 *   If true, wait for the end of the transfer between the MIRx registers and
 *   the RAM to exit. If false, exit immediately, the transfer can still be
 *   in progress.
 ******************************************************************************/
void CAN_SetIdAndFilter(CAN_TypeDef *can,
                        uint8_t interface,
                        bool useMask,
                        const CAN_MessageObject_TypeDef *message,
                        bool wait)
{
    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((message->msgNum > 0) && (message->msgNum <= 32));

    CAN_MIR_TypeDef *mir = &can->MIR[interface];
    CAN_ReadyWait(can, interface);

    /* Set which registers to read from the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD_READ
                   | CAN_MIR_CMDMASK_ARBACC
                   | CAN_MIR_CMDMASK_CONTROL;

    /* Send reading request and wait (3 to 6 cpu cycle) */
    CAN_SendRequest(can, interface, message->msgNum, true);

    /* Reset MSGVAL */
    mir->CMDMASK |= CAN_MIR_CMDMASK_WRRD;
    mir->ARB &= ~(0x1 << _CAN_MIR_ARB_MSGVAL_SHIFT);
    CAN_SendRequest(can, interface, message->msgNum, true);

