ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/src/em_can.c
    /* Set which registers to write to the RAM */
    mir->CMDMASK |= CAN_MIR_CMDMASK_MASKACC;

    /* Set UMASK bit */
    BUS_RegBitWrite(&mir->CTRL, _CAN_MIR_CTRL_UMASK_SHIFT, useMask);

    /* Configure the id */
    if (message->extended) {
        EFM_ASSERT(message->id <= _CAN_MIR_ARB_ID_MASK);
        mir->ARB = (mir->ARB & ~_CAN_MIR_ARB_ID_MASK)
                   | (message->id << _CAN_MIR_ARB_ID_SHIFT)
                   | (uint32_t)(0x1 << _CAN_MIR_ARB_MSGVAL_SHIFT)
                   | CAN_MIR_ARB_XTD_EXT;
    } else {
        EFM_ASSERT(message->id <= _CAN_MIR_ARB_STD_ID_MAX);
        mir->ARB = (mir->ARB & ~(_CAN_MIR_ARB_ID_MASK | CAN_MIR_ARB_XTD_STD))
                   | (message->id << _CAN_MIR_ARB_STD_ID_SHIFT)
                   | (uint32_t)(0x1 << _CAN_MIR_ARB_MSGVAL_SHIFT);
    }

    if (message->extendedMask) {
        mir->MASK = (message->mask << _CAN_MIR_MASK_MASK_SHIFT);
    } else {
        mir->MASK = (message->mask << _CAN_MIR_MASK_STD_SHIFT)
                    & _CAN_MIR_ARB_STD_ID_MASK;
    }

    /* Configure the masks */
    mir->MASK |= (message->extendedMask << _CAN_MIR_MASK_MXTD_SHIFT)
                 | (message->directionMask << _CAN_MIR_MASK_MDIR_SHIFT);

    /* Send writing request */
    CAN_SendRequest(can, interface, message->msgNum, wait);
}

/***************************************************************************//**
 * @brief
 *   Configure valid, tx/rx, remoteTransfer for a specific Message Object.
 *
 * @details
 *   The Init bit have to be 0 to use this function.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] msgNum
 *   Message number of this Message Object, [1 - 32].
 *
 * @param[in] valid
 *   true if Message Object is valid, false otherwise.
 *
 * @param[in] tx
 *   true if Message Object is used for transmission, false if used for
 *   reception.
 *
 * @param[in] remoteTransfer
 *   true if Message Object is used for remote transmission, false otherwise.
 *
 * @param[in] endOfBuffer
 *   true if it is for a single Message Object or the end of a fifo buffer,
 *   false if the Message Object is part of a fifo buffer and not the last.
 *
 * @param[in] wait
 *   If true, wait for the end of the transfer between the MIRx registers and
 *   the RAM to exit. If false, exit immediately, the transfer can still be
 *   in progress.
 ******************************************************************************/
void CAN_ConfigureMessageObject(CAN_TypeDef *can,
                                uint8_t interface,
                                uint8_t msgNum,
                                bool valid,
                                bool tx,
                                bool remoteTransfer,
                                bool endOfBuffer,
                                bool wait)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];

    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((msgNum > 0) && (msgNum <= 32));

    CAN_ReadyWait(can, interface);

    /* Set which registers to read from the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD_READ
                   | CAN_MIR_CMDMASK_ARBACC
                   | CAN_MIR_CMDMASK_CONTROL;

    /* Send reading request and wait (3 to 6 cpu cycle) */
    CAN_SendRequest(can, interface, msgNum, true);

    /* Set which registers to write to the RAM */
    mir->CMDMASK |= CAN_MIR_CMDMASK_WRRD;

    /* Configure valid message and direction */
    mir->ARB = (mir->ARB & ~(_CAN_MIR_ARB_DIR_MASK | _CAN_MIR_ARB_MSGVAL_MASK))
               | (valid << _CAN_MIR_ARB_MSGVAL_SHIFT)
               | (tx << _CAN_MIR_ARB_DIR_SHIFT);

    /* Set eob bit, rx and tx interrupts */
    mir->CTRL = (endOfBuffer << _CAN_MIR_CTRL_EOB_SHIFT)
                | _CAN_MIR_CTRL_TXIE_MASK
                | _CAN_MIR_CTRL_RXIE_MASK
                | (remoteTransfer << _CAN_MIR_CTRL_RMTEN_SHIFT);

    /* Send writing request */
    CAN_SendRequest(can, interface, msgNum, wait);
}

/***************************************************************************//**
 * @brief
 *   Send the data from the Message Object message.
 *
 * @details
 *   If message is configured as tx and remoteTransfer = 0, calling this function
 *   will send the data of this Message Object if its parameters are correct.
 *   If message is tx and remoteTransfer = 1, this function will set the data of
 *   message to the RAM and exit, the data will be automatically sent after
 *   reception of a remote frame.
 *   If message is rx and remoteTransfer = 1, this function will send a remote
 *   frame to the corresponding id.
 *   If message is rx and remoteTransfer = 0, the user shouldn't call this
 *   function. It will also send a remote frame.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] message
 *   Message Object
 *
 * @param[in] wait
 *   If true, wait for the end of the transfer between the MIRx registers and
 *   the RAM to exit. If false, exit immediately, the transfer can still be
 *   in progress.
 ******************************************************************************/
void CAN_SendMessage(CAN_TypeDef *can,
                     uint8_t interface,
                     const CAN_MessageObject_TypeDef *message,
                     bool wait)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];

    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((message->msgNum > 0) && (message->msgNum <= 32));
    /* Make sure dlc is in the correct range */
    EFM_ASSERT(message->dlc <= _CAN_MIR_CTRL_DLC_MASK);

    CAN_ReadyWait(can, interface);

    /* Set LEC to unused value to be sure it is reset to 0 after sending */
    BUS_RegMaskedWrite(&can->STATUS, _CAN_STATUS_LEC_MASK, 0x7);

    /* Set which registers to read from the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD_READ
                   | CAN_MIR_CMDMASK_ARBACC
                   | CAN_MIR_CMDMASK_CONTROL;

    /* Send reading request and wait (3 to 6 cpu cycle) */
    CAN_SendRequest(can, interface, message->msgNum, true);

    /* Reset MSGVAL */
    mir->CMDMASK |= CAN_MIR_CMDMASK_WRRD;
    mir->ARB &= ~(0x1 << _CAN_MIR_ARB_MSGVAL_SHIFT);
    CAN_SendRequest(can, interface, message->msgNum, true);

