ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/src/em_can.c
    /* Set which registers to write to the RAM */
    mir->CMDMASK |= CAN_MIR_CMDMASK_DATAA
                    | CAN_MIR_CMDMASK_DATAB;

    /* If tx = 1 and remoteTransfer = 1, nothing is sent */
    if (((mir->CTRL & _CAN_MIR_CTRL_RMTEN_MASK) == 0)
            || ((mir->ARB & _CAN_MIR_ARB_DIR_MASK) == _CAN_MIR_ARB_DIR_RX)) {
        mir->CTRL |= CAN_MIR_CTRL_TXRQST;
        /* DATAVALID is set only if it is not sending a remote message */
        if ((mir->CTRL & _CAN_MIR_CTRL_RMTEN_MASK) == 0) {
            mir->CTRL |= CAN_MIR_CTRL_DATAVALID;
        }
    }

    /* Set the Data length Code */
    mir->CTRL = (mir->CTRL & ~_CAN_MIR_CTRL_DLC_MASK)
                | message->dlc;

    /* Configure the id */
    if (message->extended) {
        EFM_ASSERT(message->id <= _CAN_MIR_ARB_ID_MASK);
        mir->ARB = (mir->ARB & ~_CAN_MIR_ARB_ID_MASK)
                   | (message->id << _CAN_MIR_ARB_ID_SHIFT)
                   | (uint32_t)(0x1 << _CAN_MIR_ARB_MSGVAL_SHIFT)
                   | CAN_MIR_ARB_XTD_EXT;
    } else {
        EFM_ASSERT(message->id <= _CAN_MIR_ARB_STD_ID_MAX);
        mir->ARB = (mir->ARB & ~(_CAN_MIR_ARB_ID_MASK | _CAN_MIR_ARB_XTD_MASK))
                   | (uint32_t)(0x1 << _CAN_MIR_ARB_MSGVAL_SHIFT)
                   | (message->id << _CAN_MIR_ARB_STD_ID_SHIFT)
                   | CAN_MIR_ARB_XTD_STD;
    }

    /* Set the data */
    CAN_WriteData(can, interface, message);

    /* Send writing request */
    CAN_SendRequest(can, interface, message->msgNum, wait);
}

/***************************************************************************//**
 * @brief
 *   Read the data from a Message Object in the RAM and store it in message.
 *
 * @details
 *   Read all the information from the RAM on this Message Object : the data but
 *   also the configuration of the other registers.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] message
 *   Message Object
 ******************************************************************************/
void CAN_ReadMessage(CAN_TypeDef *can,
                     uint8_t interface,
                     CAN_MessageObject_TypeDef *message)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];
    uint32_t buffer;
    uint32_t i;

    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((message->msgNum > 0) && (message->msgNum <= 32));

    CAN_ReadyWait(can, interface);

    /* Set which registers to read from the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD_READ
                   | CAN_MIR_CMDMASK_MASKACC
                   | CAN_MIR_CMDMASK_ARBACC
                   | CAN_MIR_CMDMASK_CONTROL
                   | CAN_MIR_CMDMASK_CLRINTPND
                   | CAN_MIR_CMDMASK_TXRQSTNEWDAT
                   | CAN_MIR_CMDMASK_DATAA
                   | CAN_MIR_CMDMASK_DATAB;

    /* Send reading request and wait (3 to 6 cpu cycle) */
    CAN_SendRequest(can, interface, message->msgNum, true);

    /* Get dlc from the control register */
    message->dlc = ((mir->CTRL & _CAN_MIR_CTRL_DLC_MASK) >> _CAN_MIR_CTRL_DLC_SHIFT);

    /* Make sure dlc is in the correct range */
    EFM_ASSERT(message->dlc <= 8);

    /* Copy the data from the MIR registers to the Message Object message */
    buffer = mir->DATAL;
    for (i = 0; i < SL_MIN(message->dlc, 4U); ++i) {
        message->data[i] = buffer & 0xFF;
        buffer = buffer >> 8;
    }
    if (message->dlc > 3) {
        buffer = mir->DATAH;
        for (i = 0; i < message->dlc - 4U; ++i) {
            message->data[i + 4] = buffer & 0xFF;
            buffer = buffer >> 8;
        }
    }
}

/***************************************************************************//**
 * @brief
 *   Abort the sending of a message
 *
 * @details
 *   Set the TXRQST of the CTRL register to 0. Doesn't touch the data ot the
 *   others parameters. The user can reuse CAN_SendMessage() to send the object
 *   after using CAN_AbortSendMessage().
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] msgNum
 *   Message number of this Message Object, [1 - 32].
 *
 * @param[in] wait
 *   If true, wait for the end of the transfer between the MIRx registers and
 *   the RAM to exit. If false, exit immediately, the transfer can still be
 *   in progress.
 ******************************************************************************/
void CAN_AbortSendMessage(CAN_TypeDef *can,
                          uint8_t interface,
                          uint8_t msgNum,
                          bool wait)
{
    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((msgNum > 0) && (msgNum <= 32));

    CAN_MIR_TypeDef *mir = &can->MIR[interface];
    CAN_ReadyWait(can, interface);

    /* Set which registers to write to the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD
                   | CAN_MIR_CMDMASK_ARBACC;

    /* Set TXRQST bit to 0 */
    mir->ARB &= ~_CAN_MIR_CTRL_TXRQST_MASK;

    /* Send writing request */
    CAN_SendRequest(can, interface, msgNum, wait);
}

/***************************************************************************//**
 * @brief
 *   Reset all the Message Objects and set their data to 0.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 ******************************************************************************/
void CAN_ResetMessages(CAN_TypeDef *can, uint8_t interface)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];
    CAN_ReadyWait(can, interface);

    /* Set which registers to read from the RAM */
    mir->CMDMASK = CAN_MIR_CMDMASK_WRRD
                   | CAN_MIR_CMDMASK_MASKACC
                   | CAN_MIR_CMDMASK_ARBACC
                   | CAN_MIR_CMDMASK_CONTROL
                   | CAN_MIR_CMDMASK_DATAA
                   | CAN_MIR_CMDMASK_DATAB;

    mir->MASK    = _CAN_MIR_MASK_RESETVALUE;
    mir->ARB     = _CAN_MIR_ARB_RESETVALUE;
    mir->CTRL    = _CAN_MIR_CTRL_RESETVALUE;
    mir->DATAL   = 0x00000000;
    mir->DATAH   = 0x00000000;

    /* Write each reset Message Object to the RAM */
    for (int i = 1; i <= 32; ++i) {
        CAN_SendRequest(can, interface, i, true);
    }
}

/***************************************************************************//**
 * @brief
 *   Set all the CAN registers to RESETVALUE. Leave the CAN Device disabled.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 ******************************************************************************/
void CAN_Reset(CAN_TypeDef *can)
{
    CAN_ReadyWait(can, 0);
    CAN_ReadyWait(can, 1);

