ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/src/em_can.c
    CAN_Enable(can, false);
    can->STATUS = _CAN_STATUS_RESETVALUE;

    can->CTRL |= _CAN_CTRL_CCE_MASK;
    can->BITTIMING = _CAN_BITTIMING_RESETVALUE;
    can->CTRL &= ~_CAN_CTRL_CCE_MASK;

    can->CTRL |= _CAN_CTRL_TEST_MASK;
    can->TEST = _CAN_TEST_RESETVALUE;
    can->CTRL &= ~_CAN_CTRL_TEST_MASK;

    can->BRPE = _CAN_BRPE_RESETVALUE;
    can->CONFIG = _CAN_CONFIG_RESETVALUE;
    can->IF0IFS = _CAN_IF0IFS_RESETVALUE;
    can->IF0IFC = _CAN_IF0IFC_RESETVALUE;
    can->IF0IEN = _CAN_IF0IEN_RESETVALUE;
    can->IF1IFS = _CAN_IF1IF_RESETVALUE;
    can->IF1IFC = _CAN_IF1IFC_RESETVALUE;
    can->IF1IEN = _CAN_IF1IEN_RESETVALUE;
    can->ROUTE = _CAN_ROUTE_RESETVALUE;

    for (int i = 0; i < 2; i++) {
        can->MIR[i].CMDMASK = _CAN_MIR_CMDMASK_RESETVALUE;
        can->MIR[i].MASK = _CAN_MIR_MASK_RESETVALUE;
        can->MIR[i].ARB = _CAN_MIR_ARB_RESETVALUE;
        can->MIR[i].CTRL = _CAN_MIR_CTRL_RESETVALUE;
        can->MIR[i].DATAL = _CAN_MIR_DATAL_RESETVALUE;
        can->MIR[i].DATAH = _CAN_MIR_DATAH_RESETVALUE;
        can->MIR[i].CMDREQ = _CAN_MIR_CMDREQ_RESETVALUE;
    }
}

/***************************************************************************//**
 * @brief
 *   Write the data from message to the MIRx registers
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] message
 *   Message Object
 ******************************************************************************/
void CAN_WriteData(CAN_TypeDef *can,
                   uint8_t interface,
                   const CAN_MessageObject_TypeDef *message)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];
    uint8_t data[8] = { 0 };
    size_t length = SL_MIN(8, message->dlc);

    for (size_t i = 0; i < length; i++) {
        data[i] = message->data[i];
    }

    CAN_ReadyWait(can, interface);
    mir->DATAL = (data[3] << 24)
                 | (data[2] << 16)
                 | (data[1] << 8)
                 | (data[0] << 0);
    mir->DATAH = (data[7] << 24)
                 | (data[6] << 16)
                 | (data[5] << 8)
                 | (data[4] << 0);
}

/***************************************************************************//**
 * @brief
 *   Send request for writing or reading the RAM of Message Object msgNum.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] msgNum
 *   Message number of the Message Object, [1 - 32].
 *
 * @param[in] wait
 *   If true, wait for the end of the transfer between the MIRx registers and
 *   the RAM to exit. If false, exit immediately, the transfer can still be
 *   in progress.
 ******************************************************************************/
void CAN_SendRequest(CAN_TypeDef *can,
                     uint8_t interface,
                     uint8_t msgNum,
                     bool wait)
{
    CAN_MIR_TypeDef *mir = &can->MIR[interface];

    /* Make sure msgNum is in the correct range */
    EFM_ASSERT((msgNum > 0) && (msgNum <= 32));

    /* Make sure the MIRx registers aren't busy */
    CAN_ReadyWait(can, interface);

    /* Write msgNum to the CMDREQ register */
    mir->CMDREQ = msgNum << _CAN_MIR_CMDREQ_MSGNUM_SHIFT;

    if (wait) {
        CAN_ReadyWait(can, interface);
    }
}

/** @} (end addtogroup CAN) */
/** @} (end addtogroup emlib) */

#endif /* defined(CAN_COUNT) && (CAN_COUNT > 0) */
